src/DataProcessors/ВыполнениеИнвентаризации/ВыполнениеИнвентаризации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыполнениеИнвентаризации</name>
</mdclass:DataProcessor>

src/Documents/ИнвентаризацияСклад/ИнвентаризацияСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИнвентаризацияСклад</name>
  <comment>Аналог документа из ТШК 1С 7.7.</comment>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Штрихкоды</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Технологический штрихкод (19 символов) или часть кода маркировки (первые 31 символ).</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>31</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комплектовщик</name>
      <type>
        <types>CatalogRef.Комплектовщики</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЯчейки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЯчейкиКомплектовщиков</name>
    <comment>Нужно для восстановления значения текущей ячейки при выполнении инвентаризации.</comment>
    <attributes>
      <name>Комплектовщик</name>
      <type>
        <types>CatalogRef.Комплектовщики</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЯчейки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ВыполнениеИнвентаризации/Forms/ФормаВыбораИнвентаризацииОбуви/Module.bsl
// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаКомплектовщик = Параметры.Комплектовщик;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

    // Отключение видимости шапки динамического списка, чтобы сэкономить место на экране 
    Элементы.СписокИнвентаризацийОбуви.Шапка = Ложь;

#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокИнвентаризацийОбуви

// Процедура открывает форму для заполнения инвентаризации.
// 
// Параметры:
//  Элемент - ТаблицаФормы - Список заданий
//  Значение - ДокументСсылка.Задание - Выбранное задание
//  СтандартнаяОбработка - Булево
&НаКлиенте
Процедура СписокИнвентаризацийОбувиВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Ключ", Значение);
    ПараметрыФормы.Вставить("Комплектовщик", ФормаКомплектовщик);

    ОткрытьФорму("Документ.ИнвентаризацияСклад.Форма.ФормаВыполнения", ПараметрыФормы);
    
    Закрыть();

КонецПроцедуры

#КонецОбласти
